# 中国期货主力合约代码字典

def get_futures_main_contracts():
    return futures_main_contracts

futures_main_contracts = {
    # 中国金融期货交易所 (CFFEX)  8个
    "CFFEX": {
        "IC": "中证500期货主力合约",
        "IF": "沪深300期货主力合约",
        "IH": "上证50期货主力合约",
        "IM": "中证1000期货主力合约",
        "T": "10年期国债期货主力合约",
        "TF": "5年期国债期货主力合约",
        "TS": "2年期国债期货主力合约",
        "TL": "30年期国债期货主力合约"
    },

    # 上海期货交易所 (SHFE)  20个
    "SHFE": {
        "AD": "铝合金主力合约",
        "AG": "白银主力合约",
        "AL": "铝主力合约",
        "AO": "氧化铝主力合约",
        "AU": "黄金主力合约",
        "BR": "丁二烯橡胶主力合约",
        "BU": "沥青主力合约",
        "CU": "铜主力合约",
        "FU": "燃油主力合约",
        "HC": "热卷主力合约",
        "NI": "镍主力合约",
        "OP": "双胶纸主力合约",
        "PB": "铅主力合约",
        "RB": "螺纹钢主力连合约",
        "RU": "橡胶主力合约",
        "SN": "锡主力合约",
        "SP": "纸浆主力连合约",
        "SS": "不锈钢主力合约",
        # "WR": "线材主力合约",
        "ZN": "锌主力合约"
    },

    # 郑州商品交易所 (CZCE)    3位合约后缀   24个
    "CZCE": {
        "AP": "苹果主力合约",
        "CF": "棉花主力合约",
        "CJ": "红枣主力合约",
        "CY": "棉纱主力合约",
        "FG": "玻璃主力合约",
        # "JR": "粳稻主力合约",
        # "LR": "晚籼稻主力合约",
        "MA": "甲醇主力合约",
        "OI": "菜油主力合约",
        "PF": "短纤主力合约",
        "PK": "花生主力合约",
        # "PM": "普麦主力合约",
        "PX": "对二甲苯主力合约",
        # "RI": "早籼稻主力合约",
        "RM": "菜粕主力合约",
        # "RS": "菜籽主力合约",
        "SA": "纯碱主力合约",
        "SF": "硅铁主力合约",
        "SM": "锰硅主力合约",
        "SR": "白糖主力合约",
        "TA": "PTA主力合约",
        "UR": "尿素主力合约",
        # "WH": "强麦主力合约",
        # "ZC": "动力煤主力合约"
    },

    # 大连商品交易所 (DCE)  23个
    "DCE": {
        "A": "豆一主力合约",
        "B": "豆二主力合约",
        # "BB": "胶合板主力合约",
        "BZ": "纯苯主力合约",
        "C": "玉米主力合约",
        "CS": "玉米淀粉主力合约",
        "EB": "苯乙烯主力合约",
        "EG": "乙二醇主力合约",
        # "FB": "纤维板主力合约",
        "I": "铁矿石主力合约",
        "J": "焦炭主力合约",
        "JD": "鸡蛋主力合约",
        "JM": "焦煤主力合约",
        "L": "塑料主力合约",
        "LG": "原木主力合约",
        "LH": "生猪主力合约",
        "M": "豆粕主力合约",
        "P": "棕榈油主力合约",
        "PG": "液化石油气主力合约",
        "PP": "聚丙烯主力合约",
        # "RR": "粳米主力合约",
        "V": "PVC主力合约",
        "Y": "豆油主力合约"
    },

    # 上海国际能源交易中心 (INE)  5个
    "INE": {
        "BC": "国际铜主力合约",
        "EC": "欧线集运主力合约",
        "LU": "低硫燃料油合约",
        "NR": "20号胶主力合约",
        "SC": "原油主力合约"
    },

    # 广州期货交易所 (GFEX)   5个
    "GFEX": {
        "LC": "碳酸锂主力合约",
        "SI": "工业硅主力合约",
        "PS": "多晶硅主力合约",
        "PT": "铂主力合约",
        "PD": "钯主力合约",
    }
}

# 测试用例
if __name__ == "__main__":
    # 测试交易所访问
    print("GFEX.PS 对应:", futures_main_contracts["GFEX"]["PS"])

    # 遍历所有交易所
    for exchange, contracts in futures_main_contracts.items():
        print(f"\n{exchange} 交易所合约:")
        for code, name in contracts.items():
            print(f"{exchange}.{code}: {name}")
